100askTeam/arduino-imx6ull/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.

imx6ull.name=100ask_imx6ull


imx6ull.upload.tool=copy
imx6ull.upload.protocol=copy
imx6ull.upload.verbose=
imx6ull.upload.speed=115200

imx6ull.build.mcu=100ask_imx6ull
imx6ull.build.f_cpu=
imx6ull.build.board=RASPI
imx6ull.build.core=100ask_imx6ull
imx6ull.build.variant=100ask_imx6ull
imx6ull.build.debug_flags=
imx6ull.build.optimization_flags=-O3

imx6ull.upload.maximum_size=10485760
imx6ull.upload.maximum_data_size=10485760
